Repository: xvitaly/mhed
Catalog: src/mhed/AppStrings.*.resx
Languages: it, ru

# AHE_ExceptionDetected
source: Warning! A parsing error was encountered. The file {0} was probably loaded with errors.
it: Avviso! Si è verificato un errore di analisi. Probabilmente il file {0} è stato caricato con errori.
ru: Во время открытия файла {0} произошла ошибка. Он мог быть загружен некорректно!

# AHE_HMessg
source: Hosts file: {0}. Show it in file manager?
it: Il file hosts attivo si trova in {0}. Vuoi visualizzarlo nel gestore file?
ru: Активный файл Hosts расположен в: {0}. Показать его в файловом менеджере?

# AHE_NoFileDetected
source: The Hosts file {0} couldn't be found!
it: Impossibile trovare il file Hosts {0}!
ru: Файл Hosts по пути {0} не найден!

# AHE_RestDef
source: Restore default Hosts file?
it: Vuoi ripristinare il file Hosts predefinito?
ru: Восстановить стандартные значения файла Hosts?

# AHE_Saved
source: Hosts file saved successfully!
it: File host salvato correttamente!
ru: Изменения в файле hosts были успешно сохранены!

# AHE_SaveException
source: Warning! An error occurred while writing to file {0}. Maybe you don't have enough rights to do this, or someone is blocking write attempts.
it: Attenzione! Si è verificato un errore durante la scrittura nel file {0}. Forse non disponi di diritti sufficienti per farlo o qualcuno sta bloccando i tentativi di scrittura.
ru: Внимание! Произошла ошибка во время записи в файл {0}. Возможно, у вас недостаточно для этого прав, либо кто-то блокирует попытку записи.

# AHE_NoAdminRights
source: Administrator rights are required to perform the requested action!
it: Per eseguire l'azione richiesta sono necessari i diritti di amministratore!
ru: Для выполнения этого действия необходимы права локального администратора!

# AHE_AlreadyRunning
source: The program is already running. Starting the second copy is not allowed.
it: Il programma è già in esecuzione. Non è consentito avviare la seconda copia.
ru: Программа уже запущена! Запуск дополнительных копий не допускается.

# AHE_IncorrectIPAddress
source: Incorrect IP-address entered!
it: È stato inserito un indirizzo IP errato!
ru: Введён недействительный IP-адрес!

# AHE_ClipboardCopyError
source: Failed to copy selected data to the clipboard!
it: Impossibile copiare i dati selezionati negli appunti!
ru: Произошла ошибка при попытке скопироать содержимое выбранной ячейки в буфер обмена!

# AHE_ClipboardCutError
source: Failed to cut selected data to the clipboard!
it: Impossibile tagliare i dati selezionati negli appunti!
ru: Произошла ошибка при попытке вырезать содержимое выбранной ячейки в буфер обмена!

# AHE_ClipboardPasteError
source: Failed to paste data from the clipboard!
it: Impossibile incollare i dati dagli appunti!
ru: Произошла ошибка при попытке вставить содержимое буфера обмена в выбранную ячейку!

# AHE_DeleteRowError
source: Failed to delete the selected rows!
it: Impossibile eliminare le righe selezionate!
ru: Произошла ошибка при попытке удаления выбранных строк!

# AHE_OpenInNotepadError
source: Failed to load Hosts file into the selected text editor!
it: Impossibile caricare il file Hosts nell'editor testo selezionato!
ru: Произошла ошибка при попытке загрузки файла в выбранном текстовом редакторе!

# AHE_OpenShellError
source: Failed to show Hosts file in default file manager!
it: Impossibile visualizzare il file Hosts nel file manager predefinito!
ru: Произошла ошибка при попытке показать файл в оболочке по умолчанию!

# AHE_ExitConfirmation
source: Exit {0} without saving changes?
ru: Выйти из {0} без сохранения изменений?

# AHE_LibraryVersionMissmatch
source: The core library version does not match the application's version. Please reinstall or report this issue to developers.
it: La versione della libreria principale non corrisponde alla versione dell'applicazione. Reinstallala o segnala il problema agli sviluppatori.
ru: Обнаружено несоответствие между версиями приложения и основной библиотеки функций! Сообщите об этом разработчикам, либо переустановите программу.

# AHE_OptionsSaved
source: Settings were saved successfully!
ru: Настройки были успешно сохранены!

# AHE_UrlOpenError
source: Failed to load URL in default web browser!
it: Impossibile caricare l'URL nel browser web predefinito!
ru: Произошла ошибка при попытке открыть адрес в браузере по умолчанию!

# AHE_LangPrefix
source: en
it: it
ru: ru

# AHE_ShowHelpError
source: Failed to start the offline help viewer with the required documentation page!
it: Impossibile avviare il visualizzatore della guida offline con la pagina della documentazione richiesta!
ru: Произошла ошибка при запуске средства просмотра оффлайновой справочной системы с запрошенной страницей!

# AHE_ChmFileNotFound
source: The offline help system file is not installed, or is not supported by the selected program language!
it: Il file di sistema della guida offline non è installato o non è supportato dalla lingua del programma selezionata!
ru: Файл оффлайновой справочной системы не установлен, либо не поддерживается для данной языковой версии!

# AHE_IncorrectHostname
source: Incorrect hostname entered!
it: È stato inserito un nome host errato!
ru: Введено недействительное имя хоста!

# AHE_RestartAsAdminError
source: Failed to restart the application with administrator rights!
it: Impossibile riavviare l'applicazione con diritti di amministratore!
ru: Не удалось повысить права приложения до администратора!

# AHE_RestartAsAdminNotImplemented
source: Restarting the application hasn't yet been implemented on current platform!
it: Il riavvio dell'applicazione non è ancora stato implementato nella piattaforma attuale!
ru: Автоматический перезапуск приложения с правами администратора в настоящее время не поддерживается на данной платформе!

# AHE_RestartAsAdminQuestion
source: Restart this application as an administrator?
it: Vuoi riavviare questa applicazione come amministratore?
ru: Перезапустить приложение с правами администратора?

# AHE_RestartAsAdminRunning
source: This application is already running with administrator rights!
it: Questa applicazione è già in esecuzione con diritti di amministratore!
ru: Приложение уже запущено с правами администратора!

# AHE_ImportSettingsError
source: Failed to import settings from a previous version of the application! All settings will be reset to their default values.
it: Impossibile importare le impostazioni da una versione precedente dell'applicazione! Tutte le impostazioni verranno ripristinate ai valori predefiniti.
ru: Произошла ошибка во время импортирования настроек из предыдущей версии программы! Параметры будут сброшены на стандартные значения.

# AHE_LogFileNotFound
source: The log file is empty or doesn't exist!
it: Il file registro eventi è vuoto o non esiste!
ru: Файл журнала работы программы пуст, либо не существует!

# AHE_ShowLogFileError
source: Failed to show debug log file!
it: Impossibile visualizzare il file registro eventi debug!
ru: Не удалось отобразить отладочный журнал программы!

# AHE_UpdateAvailable
source: Application update available. New version: {0}.
ru: Доступно обновление программы. Новая версия: {0}.

# AHE_UpdateCheckFailure
source: Update check failed. Please try again later.
ru: Произошла ошибка во время проверки обновлений программы.

# AHE_UpdateFailure
source: An error occurred while trying to run the installer. The program has not been updated. Run the update again later!
ru: Произошла ошибка при попытке запуска программы установки новой версии. Программа не была обновлена. Запустите обновление повторно позднее!

# AHE_UpdateHashFailure
source: Downloaded file has incorrect hash. Maybe it was corrupted during transfer. Please try again later!
ru: Контрольная сумма загруженного файла отличается от эталона. Обновление не было установлено!

# AHE_UpdateLatestInstalled
source: Update is not required because you have the latest version of the program.
ru: Обновление не требуется, т.к. у вас установлена последняя версия программы.

# AHE_UpdateNotAvailable
source: No new updates available. Your application is up to date.
ru: Нет новых обновлений программы. Установлена новейшая версия.

# AHE_UpdateOtherPlatform
source: A new version {0} is available, but automatic updates are not supported on this platform. Do you want to see the changelog page, including download links, in a web browser?
ru: Доступна новая версия {0} программы, однако автоматические обновления на данной платформе не поддерживаются. Показать список изменений и ссылки для скачивания в веб-браузере?

# AHE_UpdateSuccessful
source: The new version has been successfully received from server. We will install it now!
ru: Новая версия была успешно получена с сервера. Сейчас будет произведена её установка!

# AHE_WrkInProgress
source: Checking for updates... Please wait!
ru: Пожалуйста, дождитесь завершения проверки обновлений!

# AHE_NewVersionAvailable
source: A new update for {0} is available. We recommend you to upgrade as soon as possible via Help - Check for updates, or manually.
it: È disponibile un nuovo aggiornamento per {0}. Ti consigliamo di eseguire l'aggiornamento il prima possibile tramite Guida - Verifica aggiornamenti o manualmente.
ru: Внимание! Доступно обновление программы {0}. Рекомендуем вам обновиться как можно скорее через меню Справка - Проверить наличие обновлений, либо вручную.

# AHE_ClipboardNonIPAddress
source: Clipboard doesn't contain a valid IP-address!
it: Gli appunti non contengono un indirizzo IP valido!
ru: В буфере обмена не содержится действительный IP-адрес!

# AHE_AppStatusRO
source: R/O
it: S/L

# AHE_ClipboardNonHostname
source: Clipboard doesn't contain a valid hostname!
it: Gli appunti non contengono un nome host valido!

# AHE_Exported
source: Hosts file has been successfully exported!
it: Il file Hosts è stato esportato correttamente

# AHE_ExportException
source: Warning! An error occurred while exporting to file. Maybe you don't have enough rights to do this, or someone is blocking write attempts.
it: Attenzione! Si è verificato un errore durante l'esportazione nel file. Forse non disponi dei diritti sufficienti per farlo o qualcuno sta bloccando i tentativi di scrittura.

# AHE_Imported
source: The content has been successfully imported and added to the table!
it: Il contenuto è stato importato e aggiunto correttamente alla tabella!

# AHE_ImportFileNotFound
source: The selected file to import was not found!
it: Il file selezionato per l'importazione non è stato trovato!

# AHE_ImportFileException
source: An error occurred while importing the selected file!
it: Si è verificato un errore durante l'importazione del file selezionato!

# AHE_ClipboardNonComment
source: Clipboard doesn't contain a valid comment!
it: Gli appunti non contengono un commento valido!

# AHE_ClipboardFormatError
source: Failed to paste rows from the clipboard due to a format error!
it: Impossibile incollare le righe dagli appunti a causa di un errore di formato!

# AHE_IncorrectComment
source: Incorrect comment entered!
it: È stato inserito un commento errato!
