Repository: xvitaly/mhed
Catalog: docs/source/locale/*/LC_MESSAGES/getting-started.po
Languages: ru

source: Getting started
ru: Приступая к работе

source: Starting program
ru: Запуск программы

source: You can launch Micro Hosts Editor from the Start menu right after installation: **Start** -- **Micro Hosts Editor** -- **Micro Hosts Editor**.
ru: Запустить программу можно сразу после установки через меню **Пуск** -- **Micro Hosts Editor** -- **Micro Hosts Editor**.

source: Localization selection
ru: Выбор локализации

source: Micro Hosts Editor will automatically detect and use the default OS language if supported by the application.
ru: Micro Hosts Editor автоматически выбирает язык в зависимости от региональных настроек операционной системы, если он поддерживается приложением.

source: Admin permissions
ru: Работа с повышенными правами

source: Micro Hosts Editor can be started with or without administrator rights.
ru: Micro Hosts Editor может быть запущена как с правами локального администратора, так и без них.

source: When started as a regular user, it will work in read-only mode because only members of the Administrators group can edit Hosts file.
ru: Если запуск был произведён с правами обычного пользователя, программа будет работать в режиме "только чтение", т.к. только участники группы Администраторы могут редактировать файл Hosts.

source: If you want to edit Hosts file, you will need to run this program as an administrator. Right-click on the Micro Hosts Editor shortcut in the Start menu or on desktop, select **Run with administrator** and confirm this action in the Windows UAC dialog box.
ru: Таким образом, если вы хотите редактировать файл Hosts, вы должны запустить программу с правами локального администратора. Для этого нажмите правой кнопкой мыши по ярлыку Micro Hosts Editor в меню Пуск, либо на рабочем столе и из контекстного меню выберите пункт **Запуск от имени администратора**, затем подтвердите своё намерение в появившемся окне Windows UAC.

source: To always run this application with administrator rights, right-click the shortcut, select the **Properties** context menu item, go to the **Compatibility** tab, check the **Run this program as an administrator** checkbox and click **OK** button.
ru: Чтобы всегда запускать это приложение с правами администратора, щёлкните правой кнопкой мыши по ярлыку, выберите пункт контекстного меню **Свойства**, перейдите на вкладку **Совместимость**, установите флажок **Запускать эту программу от имени администратора** и нажмите кнопку **ОК**.

source: The program can automatically handle this situation and restart with the correct permissions if you click the green circle in the status bar.
ru: Программа может автоматически справиться с этой ситуацией и перезапуститься с правильными разрешениями, если вы кликните по зелёному кружку в строке состояния.

source: Startup actions
ru: Действия, выполняемые при запуске

source: The following actions will be performed on Micro Hosts Editor's startup:
ru: Следующие действия выполняются автоматически при запуске Micro Hosts Editor:

source: getting Hosts file path;
ru: получение пути к используемому файлу Hosts;

source: checking if the Hosts file exists;
ru: проверка на существование файла Hosts;

source: performing internal startup actions;
ru: выполнение внутренних процедур инициализации;

source: creating user-friendly GUI;
ru: создание графического интерфейса пользователя;

source: working with updates, if enabled in :ref:`Advanced settings <settings-advanced>`.
ru: работа с обновлениями, если это разрешено в :ref:`Расширенных настройках <settings-advanced>`.

source: If the program cannot find path to Hosts file in the Windows Registry (only on Microsoft Windows platform), it will use the default well-known location.
ru: Если программа не сможет найти расположение файла Hosts в реестре Windows (только для платформы Microsoft Windows), она продолжит поиск в стандартных известных каталогах.

source: Data files storage
ru: Хранение файлов программы

source: All program settings are stored in the ``%LOCALAPPDATA%\EasyCoding_Team`` directory (each subdirectory for every version).
ru: Настройки программы хранятся в каталоге ``%LOCALAPPDATA%\EasyCoding_Team``, для каждой версии отдельно.

source: Logs -- ``%LOCALAPPDATA%\mhed\logs``.
ru: Журналы работы -- ``%LOCALAPPDATA%\mhed``.

source: Uninstalling program
ru: Удаление программы

source: If you want to uninstall Micro Hosts Editor from your compuler, use **Start** -- **Settings** -- **Apps** -- **Apps & features** -- **Micro Hosts Editor** -- **Uninstall**.
ru: Чтобы удалить Micro Hosts Editor, запустите встроенную программу удаления через **Пуск** -- **Параметры** -- **Приложения** -- **Приложения и возможности** -- **Micro Hosts Editor** -- **Удалить**.

source: Uninstaller will automatically remove all program files, shortcuts, registry entries, but will save created by user :ref:`data files <gs-datafiles>`. You can remove them manually.
ru: Программа автоматического удаления сотрёт все файлы программы, записи реестра, ярлыки, но сохранит настройки и резервные копии на случай если вы решите когда-нибудь переустановить её. Эти :ref:`файлы <gs-datafiles>` вы можете удалить вручную.

source: Mono issues
ru: Проблемы с Mono

source: When running under Mono, the program may crash on start with the following error:
ru: При запуске программы с использованием Mono, может произойти падение со следующей ошибкой:

source: This is a known `upstream issue <https://github.com/mono/mono/issues/21630>`__.
ru: Это `известная проблема <https://github.com/mono/mono/issues/21630>`__.

source: It can be trivially workarounded by editing the ``mhed.exe.config`` file and removing the following lines:
ru: Её достаточно просто решить, открыв в текстовом редакторе файл ``mhed.exe.config`` и удалив следующие строки:

source: The next launch will be successful.
ru: Следующий запуск будет успешным.
